---
kind: property
id: P:Autodesk.Revit.DB.ImageType.PageNumber
source: html/2500b06c-f131-8d7b-3fb4-bd3e66335708.htm
---
# Autodesk.Revit.DB.ImageType.PageNumber Property

The number of the page in a multi-page file, that was used to create the image in the ImageType.

## Syntax (C#)
```csharp
public int PageNumber { get; }
```

## Remarks
This number is set when the ImageType is created or reloaded.